Revit 2027 API
BuiltInFailures.MEPCalculationFailures.DuctPressureDropCalculatorNotAvailable Property
 Duct Pressure Drop Calculator Not Available: [Calculator Name]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DuctPressureDropCalculatorNotAvailable { get; }
Public Shared ReadOnly Property DuctPressureDropCalculatorNotAvailable As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DuctPressureDropCalculatorNotAvailable {
	FailureDefinitionId^ get ();
}
static member DuctPressureDropCalculatorNotAvailable : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace